ab_dynamic_proxy.txt
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking meowbook.org (be patient)


Server Software:        nginx/1.15.2
Server Hostname:        meowbook.org
Server Port:            80

Document Path:          /api
Document Length:        50 bytes

Concurrency Level:      16
Time taken for tests:   7.509 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      895000 bytes
HTML transferred:       250000 bytes
Requests per second:    665.88 [#/sec] (mean)
Time per request:       24.028 [ms] (mean)
Time per request:       1.502 [ms] (mean, across all concurrent requests)
Transfer rate:          116.40 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     3   24  29.8     21     506
Waiting:        2   24  29.8     21     506
Total:          3   24  29.8     21     506

Percentage of the requests served within a certain time (ms)
  50%     21
  66%     21
  75%     22
  80%     22
  90%     23
  95%     25
  98%     29
  99%     43
 100%    506 (longest request)